In [8]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
rds_connection_string = "postgres:postgres@localhost:5432/Project2"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [4]:
engine.table_names()

['wiki_data', 'imdb_data']

In [9]:
csv_file = "imdb_data.csv"
imdb_data = pd.read_csv(csv_file)
imdb_data.head()

   Movie Rating  User Votes                     Title
0           9.3     2536461  The Shawshank Redemption
1           9.0     2486973           The Dark Knight
2           8.8     2228680                 Inception
3           8.8     1996157                Fight Club
4           8.8     1957578              Forrest Gump

In [12]:
new_imdb = imdb_data[['Movie Rating', 'User Votes', 'Title']].copy()

In [14]:
new_imdb.to_sql(name='imdb_data', con=engine, if_exists='append', index=False)

In [15]:
pd.read_sql_query('select * from imdb_data', con=engine).head()

   Movie Rating  User Votes                     Title
0           9.3     2536461  The Shawshank Redemption
1           9.0     2486973           The Dark Knight
2           8.8     2228680                 Inception
3           8.8     1996157                Fight Club
4           8.8     1957578              Forrest Gump